[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:8:7
 import PropTypes from "prop-types";
 
 const formatApprovalDate = (dateApproved) => {
-  if (typeof dateApproved !== "string") {
+  if (false) {
     return null;
   }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Cannot read properties of null (reading 'match')

[Survived] Regex
main/components/Users/UsersTable.jsx:12:36
     return null;
   }
 
-  const match = dateApproved.match(/^(\d{4})-(\d{2})-(\d{2})$/);
+  const match = dateApproved.match(/(\d{4})-(\d{2})-(\d{2})$/);
   if (!match) {
     return null;

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:13:7
   }
 
   const match = dateApproved.match(/^(\d{4})-(\d{2})-(\d{2})$/);
-  if (!match) {
+  if (match) {
     return null;
   }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: match is not iterable

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:13:7
   }
 
   const match = dateApproved.match(/^(\d{4})-(\d{2})-(\d{2})$/);
-  if (!match) {
+  if (true) {
     return null;
   }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:24:5
   const date = new Date(Date.UTC(year, month - 1, day));
 
   if (
-    date.getUTCFullYear() !== year ||
-    date.getUTCMonth() !== month - 1 ||
-    date.getUTCDate() !== day
+    true
   ) {
     return null;
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Survived] LogicalOperator
main/components/Users/UsersTable.jsx:24:5
   const date = new Date(Date.UTC(year, month - 1, day));
 
   if (
-    date.getUTCFullYear() !== year ||
-    date.getUTCMonth() !== month - 1 ||
+    date.getUTCFullYear() !== year && date.getUTCMonth() !== month - 1 ||
     date.getUTCDate() !== day
   ) {

[Survived] ConditionalExpression
main/components/Users/UsersTable.jsx:25:5
 
   if (
     date.getUTCFullYear() !== year ||
-    date.getUTCMonth() !== month - 1 ||
+    false ||
     date.getUTCDate() !== day
   ) {

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:26:5
   if (
     date.getUTCFullYear() !== year ||
     date.getUTCMonth() !== month - 1 ||
-    date.getUTCDate() !== day
+    date.getUTCDate() === day
   ) {
     return null;
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:27:5
     date.getUTCFullYear() !== year ||
     date.getUTCMonth() !== month - 1 ||
     date.getUTCDate() !== day
-  ) {
-    return null;
-  }
+  ) {}
 
   return `${month}/${day}/${year}`;
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: expected [ <td role="cell" …(1)></td>, …(1) ] to have a length of 3 but got 2

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:71:24
   },
   {
     Header: "Status",
-    accessor: (row) => {
-      if (row.status === "Approved") {
-        const formattedDate = formatApprovalDate(row.dateApproved);
-        if (!formattedDate) {
-          return row.status;
-        }
-        return `Approved on ${formattedDate}`;
-      }
-      return row.status;
-    },
+    accessor: (row) => {},
   },
 ];
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:72:11
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "Approved") {
+      if (row.status !== "Approved") {
         const formattedDate = formatApprovalDate(row.dateApproved);
         if (!formattedDate) {
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:72:11
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "Approved") {
+      if (true) {
         const formattedDate = formatApprovalDate(row.dateApproved);
         if (!formattedDate) {
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Rejected. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:102:5
   );
 
   const toggleModeratorMutation = useBackendMutation(
-    (cell) => ({
-      url: "/api/admin/toggleModerator",
-      method: "PUT",
-      params: {
-        id: cell.row.values.id,
-      },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: UserTable tests Clicking Toggle Moderator calls the toggleModerator endpoint
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:105:15
     (cell) => ({
       url: "/api/admin/toggleModerator",
       method: "PUT",
-      params: {
-        id: cell.row.values.id,
-      },
+      params: {},
     }),
     {
killedBy: UserTable tests Clicking Toggle Moderator calls the toggleModerator endpoint
statusReason: expected {} to deeply equal { id: 1 }

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:110:24
       },
     }),
     {
-      onSuccess: () => {
-        toast("Moderator status toggled");
-      },
+      onSuccess: () => {},
     },
     ["/api/admin/users"],
killedBy: UserTable tests Clicking Toggle Moderator calls the toggleModerator endpoint
statusReason: expected "vi.fn()" to be called with arguments: [ 'Moderator status toggled' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:119:9
 
   const toggleAdminColumn = {
     Header: "Toggle Admin",
-    id: "toggle-admin",
+    id: "",
     Cell: (cell) => (
       <Button
killedBy: UserTable tests shows toggle columns and buttons when enabled
statusReason: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-admin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:123:18
     Cell: (cell) => (
       <Button
         variant="primary"
-        onClick={() => toggleAdminMutation.mutate(cell)}
+        onClick={() => undefined}
         data-testid={`UsersTable-cell-row-${cell.row.index}-col-toggle-admin-button`}
       >
killedBy: UserTable tests Clicking Toggle Admin calls the toggleAdmin endpoint
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:131:33
     ),
   };
 
-  const toggleModeratorColumn = {
-    Header: "Toggle Moderator",
-    id: "toggle-moderator",
-    Cell: (cell) => (
-      <Button
-        variant="primary"
-        onClick={() => toggleModeratorMutation.mutate(cell)}
-        data-testid={`UsersTable-cell-row-${cell.row.index}-col-toggle-moderator-button`}
-      >
-        Toggle Moderator
-      </Button>
-    ),
-  };
+  const toggleModeratorColumn = {};
 
   return (
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:137:18
     Cell: (cell) => (
       <Button
         variant="primary"
-        onClick={() => toggleModeratorMutation.mutate(cell)}
+        onClick={() => undefined}
         data-testid={`UsersTable-cell-row-${cell.row.index}-col-toggle-moderator-button`}
       >
killedBy: UserTable tests Clicking Toggle Moderator calls the toggleModerator endpoint
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table
