[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:40:19
       );
       toast(`Review ${id} updated`);
       navigate(-1);
-    } catch (err) {
-      let errorMessage = err.message;
-      if (err.response && err.response.data && err.response.data.error) {
-        errorMessage = err.response.data.error;
-      }
-      toast.error(`Error updating review: ${errorMessage}`);
-    }
+    } catch (err) {}
   };
 
killedBy: EditReviewPage tests shows server error message when update fails with an error field
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/pages/Reviews/EditReviewPage.jsx:53:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {!review || !review.item ? (
+        {!review && !review.item ? (
           <p>Loading review...</p>
         ) : (
killedBy: EditReviewPage tests loads the review into the edit form
statusReason: Cannot read properties of undefined (reading 'item')
