[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:24:19
     },
   });
 
-  useEffect(() => {
-    if (initialContents) {
-      reset(initialContents);
-    }
-  }, [initialContents, reset]);
+  useEffect(() => {}, [initialContents, reset]);
 
   return (
killedBy: ReviewForm tests renders with initialContents; EditReviewPage tests loads the review into the edit form
statusReason: expect(element).toHaveValue(Good food)

Expected the element to have value:
  Good food
Received:

[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:25:26
   });
 
   useEffect(() => {
-    if (initialContents) {
-      reset(initialContents);
-    }
+    if (initialContents) {}
   }, [initialContents, reset]);
 
killedBy: ReviewForm tests renders with initialContents
statusReason: expect(element).toHaveValue(Good food)

Expected the element to have value:
  Good food
Received:

[Survived] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:25:9
   });
 
   useEffect(() => {
-    if (initialContents) {
+    if (true) {
       reset(initialContents);
     }

[Killed] BooleanLiteral
main/components/MyReviews/ReviewForm.jsx:48:22
           id="reviewerComments"
           as="textarea"
           rows={3}
-          isInvalid={!!errors.reviewerComments}
+          isInvalid={!errors.reviewerComments}
           {...register("reviewerComments")}
         />
killedBy: ReviewForm tests comments field has no error class when valid
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-control is-invalid

[Killed] StringLiteral
main/components/MyReviews/ReviewForm.jsx:49:24
           as="textarea"
           rows={3}
           isInvalid={!!errors.reviewerComments}
-          {...register("reviewerComments")}
+          {...register("")}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ReviewForm tests renders without crashing
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/MyReviews/ReviewForm.jsx:60:23
         <Form.Label htmlFor="itemsStars">Stars (1 to 5)</Form.Label>
         <Form.Select
           id="itemsStars"
-          isInvalid={!!errors.itemsStars}
+          isInvalid={!errors.itemsStars}
           {...register("itemsStars", {
             valueAsNumber: true,
killedBy: ReviewForm tests stars field has no error class when valid
statusReason: expect(element).not.toHaveClass("is-invalid")

Expected the element not to have class:
  is-invalid
Received:
  form-select is-invalid

[Killed] BooleanLiteral
main/components/MyReviews/ReviewForm.jsx:62:28
           id="itemsStars"
           isInvalid={!!errors.itemsStars}
           {...register("itemsStars", {
-            valueAsNumber: true,
+            valueAsNumber: false,
           })}
         >
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post; ReviewForm tests calls submitAction with correct values on submit; EditReviewPage tests submits edited review and navigates back on success
statusReason: expected { itemId: undefined, …(3) } to deeply equal { itemId: undefined, …(3) }

[Killed] StringLiteral
main/components/MyReviews/ReviewForm.jsx:84:24
           id="dateItemServed"
           type="datetime-local"
           isInvalid={!!errors.dateItemServed}
-          {...register("dateItemServed", {
+          {...register("", {
             required: "Date is required",
           })}
killedBy: ReviewForm tests renders without crashing
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/MyReviews/ReviewForm.jsx:84:42
           id="dateItemServed"
           type="datetime-local"
           isInvalid={!!errors.dateItemServed}
-          {...register("dateItemServed", {
-            required: "Date is required",
-          })}
+          {...register("dateItemServed", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ReviewForm tests stars field shows is-invalid class when validation fails
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

Ignored nodes: comments, script, style
