[Killed] ObjectLiteral
main/components/Statistics/CommonsAveragesOverTimeTable.jsx:9:5
   testIdPrefix = "CommonsAveragesOverTimeTable",
 }) {
   const columns = [
-    {
-      Header: "Dining Commons",
-      accessor: "diningCommonsCode",
-    },
+    {},
     {
       Header: "Month",
killedBy: CommonsAveragesOverTimeTable tests renders all rows
statusReason: A column ID (or string accessor) is required!
