[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:40:14
               <Nav.Link href="/h2-console">H2Console</Nav.Link>
             )}
 
-            {systemInfo?.showSwaggerUILink && (
-              <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-            )}
+            {true}
           </Nav>
 
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:40:14
               <Nav.Link href="/h2-console">H2Console</Nav.Link>
             )}
 
-            {systemInfo?.showSwaggerUILink && (
-              <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
-            )}
+            {systemInfo?.showSwaggerUILink || <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>}
           </Nav>
 
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Unable to find an element with the text: Swagger. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:51:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/users">
-                    Users
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item as={Link} to="/admin/users">
+                    Users
+                  </NavDropdown.Item>
+                </NavDropdown>}
 
               {(hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:51:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/admin/users">
-                    Users
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
 
               {(hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:63:16
                 </NavDropdown>
               )}
 
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_MODERATOR")) && (
-                <NavDropdown
-                  title="Moderate"
-                  id="appnavbar-moderate-dropdown"
-                  data-testid="appnavbar-moderate-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/moderate/aliases">
-                    Moderator Page
-                  </NavDropdown.Item>
-
-                  <NavDropdown.Item as={Link} to="/moderate">
-                    Moderate Reviews
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
 
               {currentUser && currentUser.loggedIn ? (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element with the text: Moderate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:63:17
                 </NavDropdown>
               )}
 
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_MODERATOR")) && (
+              {(true) && (
                 <NavDropdown
                   title="Moderate"
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  aria-expanded="false"
  class="dropdown-toggle nav-link"
  href="#"
  id="appnavbar-moderate-dropdown"
  role="button"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.jsx:80:16
                 </NavDropdown>
               )}
 
-              {currentUser && currentUser.loggedIn ? (
+              {currentUser || currentUser.loggedIn ? (
                 <>
                   <Nav.Link as={Link} to="/myreviews">
killedBy: AppNavbar tests does not render the Statistics dropdown when user is not logged in
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="nav-item dropdown"
  data-testid="appnavbar-statistics-dropdown"
>
  <a
    aria-expanded="false"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:80:16
                 </NavDropdown>
               )}
 
-              {currentUser && currentUser.loggedIn ? (
+              {true ? (
                 <>
                   <Nav.Link as={Link} to="/myreviews">
killedBy: AppNavbar tests does not render the Statistics dropdown when user is not logged in
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="nav-item dropdown"
  data-testid="appnavbar-statistics-dropdown"
>
  <a
    aria-expanded="false"
