[Killed] StringLiteral
main/components/Statistics/CommonsMealAveragesTable.jsx:11:17
   const columns = [
     {
       Header: "Meal",
-      accessor: "mealCode",
+      accessor: "",
     },
     {
killedBy: CommonsMealAveragesTable tests renders default headers when no testIdPrefix is provided
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesTable-header-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Statistics/CommonsMealAveragesTable.jsx:15:17
     },
     {
       Header: "Average Score",
-      accessor: "averageStars",
+      accessor: "",
       Cell: ({ value }) => value.toFixed(2),
     },
killedBy: CommonsMealAveragesTable tests renders default headers when no testIdPrefix is provided
statusReason: Cannot read properties of undefined (reading 'toFixed')
