[Killed] BlockStatement
main/pages/Admin/ModeratorsCreatePage.jsx:16:36
     },
   });
 
-  const onSuccess = (moderator) => {
-    toast(`New moderator added - email: ${moderator.email}`);
-  };
+  const onSuccess = (moderator) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
