[Killed] ArrowFunction
main/pages/Admin/ModeratorsCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function ModeratorsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (moderator) => ({
-    url: "/api/admin/moderators/post",
-    method: "POST",
-    params: {
-      email: moderator.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (moderator) => {
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/ModeratorsCreatePage.jsx:30:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: ModeratorsCreatePage tests on submit, makes request to backend, and redirects to /
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/' } ]

Number of calls: 0
