[Killed] LogicalOperator
main/pages/Statistics/CommonsMealAveragesPage.jsx:16:25
 
   const [selectedCode, setSelectedCode] = useState("");
 
-  const effectiveCode = selectedCode || commons[0]?.code;
+  const effectiveCode = selectedCode && commons[0]?.code;
 
   return (
killedBy: CommonsMealAveragesPage tests defaults to the first commons and renders its meal averages section
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesSection-table-cell-row-0-col-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Statistics/CommonsMealAveragesPage.jsx:22:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Meal Averages by Dining Commons</h1>
-        {commons.length > 0 && (
+        {true && (
           <Form.Group className="mb-3">
             <Form.Label htmlFor="CommonsMealAveragesPage-commons-select">
killedBy: CommonsMealAveragesPage tests does not render the dropdown or the section when the commons list is empty
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <select
  class="form-select"
  data-testid="CommonsMealAveragesPage-commons-select"
  id="CommonsMealAveragesPage-commons-select"
/> instead

[Killed] ArrowFunction
main/pages/Statistics/CommonsMealAveragesPage.jsx:33:28
               value={effectiveCode}
               onChange={(e) => setSelectedCode(e.target.value)}
             >
-              {commons.map((c) => (
-                <option key={c.code} value={c.code}>
-                  {c.name}
-                </option>
-              ))}
+              {commons.map(() => undefined)}
             </Form.Select>
           </Form.Group>
killedBy: CommonsMealAveragesPage tests renders the heading and the commons dropdown
statusReason: Unable to find an accessible element with the role "option"

Here are the accessible roles:

  navigation:

  Name "":
  <nav
