[Killed] BooleanLiteral
main/pages/Statistics/StatisticsIndexPage.jsx:28:40
                 <Card.Body>
                   <Card.Title>{page.title}</Card.Title>
                   <Card.Text>{page.description}</Card.Text>
-                  {page.comingSoon !== false ? (
+                  {page.comingSoon !== true ? (
                     <Button
                       variant="primary"
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: expect(element).toHaveAttribute("href", "/statistics/items/best") // element.getAttribute("href") === "/statistics/items/best"

Expected the element to have attribute:
  href="/statistics/items/best"
Received:
  null
