[Killed] ArrowFunction
main/pages/Statistics/WorstItemsPage.jsx:39:33
             value={period}
             onChange={onChangePeriod}
           >
-            {PERIOD_OPTIONS.map((opt) => (
-              <option
-                key={opt.value}
-                value={opt.value}
-                data-testid={`WorstItemsPage-period-option-${opt.value}`}
-              >
-                {opt.label}
-              </option>
-            ))}
+            {PERIOD_OPTIONS.map(() => undefined)}
           </Form.Select>
         </Form.Group>
killedBy: WorstItemsPage tests renders the table when items are returned for the default ALL period
statusReason: expect(element).toHaveValue(ALL)

Expected the element to have value:
  ALL
Received:
  undefined
