[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:5:26
 
 /** Period options accepted by the best/worst items endpoints. */
 export const PERIOD_OPTIONS = [
-  { value: "ALL", label: "All time" },
+  { value: "ALL", label: "" },
   { value: "6M", label: "Last 6 months" },
   { value: "1M", label: "Last month" },
killedBy: BestItemsPage tests exposes the expected literal period options
statusReason: expected [ { value: 'ALL', label: '' }, …(3) ] to deeply equal [ { value: 'ALL', …(1) }, …(3) ]

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:6:12
 /** Period options accepted by the best/worst items endpoints. */
 export const PERIOD_OPTIONS = [
   { value: "ALL", label: "All time" },
-  { value: "6M", label: "Last 6 months" },
+  { value: "", label: "Last 6 months" },
   { value: "1M", label: "Last month" },
   { value: "1W", label: "Last week" },
killedBy: WorstItemsPage tests refetches with the new period when the dropdown changes
statusReason: expect(element).toHaveValue(6M)

Expected the element to have value:
  6M
Received:

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:48:17
     description: "Average review score for each meal at a dining commons.",
     to: "/statistics/commons/meals",
     testid: "StatisticsIndexPage-commons-meals",
-    comingSoon: false,
+    comingSoon: true,
   },
 ];
killedBy: StatisticsIndexPage tests exposes the expected comingSoon flags
statusReason: expected [ false, false, false, false, true ] to deeply equal [ false, false, false, false, false ]
