[Killed] LogicalOperator
main/components/Statistics/CommonsMealAveragesSection.jsx:15:7
     [],
   );
 
-  if (averages && averages.length === 0) {
+  if (averages || averages.length === 0) {
     return (
       <p data-testid="CommonsMealAveragesSection-empty">
killedBy: CommonsMealAveragesSection tests renders the table for the supplied dining commons code; CommonsMealAveragesPage tests defaults to the first commons and renders its meal averages section
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesSection-table-cell-row-0-col-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p
      data-testid="CommonsMealAveragesSection-empty"
    >
