[Killed] BlockStatement
main/components/Statistics/CommonsMealAveragesTable.jsx:7:4
 export default function CommonsMealAveragesTable({
   averages,
   testIdPrefix = "CommonsMealAveragesTable",
-}) {
-  const columns = [
-    {
-      Header: "Meal",
-      accessor: "mealCode",
-    },
-    {
-      Header: "Average Score",
-      accessor: "averageStars",
-      Cell: ({ value }) => value.toFixed(2),
-    },
-    {
-      Header: "Reviews",
-      accessor: "reviewCount",
-    },
-  ];
-
-  return <OurTable data={averages} columns={columns} testid={testIdPrefix} />;
-}
+}) {}
 
killedBy: CommonsMealAveragesTable tests renders default headers when no testIdPrefix is provided
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesTable-header-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
