[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:39:9
   {
     title: "Dining Commons Averages Over Time",
     description: "Average review score for each dining commons by month.",
-    to: "/statistics/commons/overtime",
+    to: "",
     testid: "StatisticsIndexPage-commons-overtime",
     comingSoon: true,
killedBy: StatisticsIndexPage tests exposes the expected list of statistics destinations
statusReason: expected [ '/statistics/items/best', …(4) ] to deeply equal [ '/statistics/items/best', …(4) ]
