[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:7:60
 export default function ReviewForm({ initialItemName, submitAction }) {
   const [comments, setComments] = React.useState("");
   const [stars, setStars] = React.useState(5);
-  const [dateServed, setDateServed] = React.useState(() => {
-    return new Date().toISOString().slice(0, 16); // Default to now, in YYYY-MM-DDTHH:mm format
-  });
+  const [dateServed, setDateServed] = React.useState(() => {});
 
   const handleSubmit = (e) => {
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] MethodExpression
main/components/MyReviews/ReviewForm.jsx:8:12
   const [comments, setComments] = React.useState("");
   const [stars, setStars] = React.useState(5);
   const [dateServed, setDateServed] = React.useState(() => {
-    return new Date().toISOString().slice(0, 16); // Default to now, in YYYY-MM-DDTHH:mm format
+    return new Date().toISOString(); // Default to now, in YYYY-MM-DDTHH:mm format
   });
 
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] ArrowFunction
main/components/MyReviews/ReviewForm.jsx:48:21
         <Form.Select
           id="review-stars"
           value={stars}
-          onChange={(e) => setStars(Number(e.target.value))}
+          onChange={() => undefined}
         >
           {[1, 2, 3, 4, 5].map((num) => (
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected { itemId: undefined, …(3) } to deeply equal { itemId: undefined, …(3) }
