[Killed] StringLiteral
main/components/Statistics/ItemStatisticsTable.jsx:11:17
   const columns = [
     {
       Header: "Item",
-      accessor: "itemName",
+      accessor: "",
     },
     {
killedBy: ItemStatisticsTable tests renders all columns and data
statusReason: Unable to find an element by: [data-testid="ItemStatisticsTable-cell-row-0-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
