[Killed] EqualityOperator
main/pages/Statistics/BestItemsPage.jsx:50:19
             ))}
           </Form.Select>
         </Form.Group>
-        {items && items.length === 0 ? (
+        {items && items.length !== 0 ? (
           <p data-testid="BestItemsPage-empty">
             No reviews available for this period yet.
killedBy: BestItemsPage tests renders the table when items are returned for the default ALL period
statusReason: Unable to find an element by: [data-testid="BestItemsPage-table-cell-row-0-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
