[Killed] ConditionalExpression
main/pages/Statistics/StatisticsIndexPage.jsx:28:20
                 <Card.Body>
                   <Card.Title>{page.title}</Card.Title>
                   <Card.Text>{page.description}</Card.Text>
-                  {page.comingSoon !== false ? (
+                  {false ? (
                     <Button
                       variant="primary"
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <a
  class="btn btn-primary"
  data-discover="true"
  data-testid="StatisticsIndexPage-commons-averages"
  href="/statistics/commons/averages"
