[Killed] StringLiteral
main/pages/Statistics/WorstItemsPage.jsx:9:40
 import { PERIOD_OPTIONS } from "main/pages/Statistics/statisticsConstants";
 
 export default function WorstItemsPage() {
-  const [period, setPeriod] = useState("ALL");
+  const [period, setPeriod] = useState("");
 
   const { data: items } = useBackend(
killedBy: WorstItemsPage tests renders the table when items are returned for the default ALL period
statusReason: Unable to find an element by: [data-testid="WorstItemsPage-table-cell-row-0-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Statistics/WorstItemsPage.jsx:16:15
     {
       method: "GET",
       url: "/api/statistics/items/worst",
-      params: { period },
+      params: {},
     },
     [],
killedBy: WorstItemsPage tests renders the table when items are returned for the default ALL period
statusReason: Unable to find an element by: [data-testid="WorstItemsPage-table-cell-row-0-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Statistics/WorstItemsPage.jsx:50:10
             ))}
           </Form.Select>
         </Form.Group>
-        {items && items.length === 0 ? (
+        {true ? (
           <p data-testid="WorstItemsPage-empty">
             No reviews available for this period yet.
killedBy: WorstItemsPage tests renders the table when items are returned for the default ALL period
statusReason: Unable to find an element by: [data-testid="WorstItemsPage-table-cell-row-0-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
