[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:30:12
     comingSoon: false,
   },
   {
-    title: "Dining Commons Averages",
+    title: "",
     description: "Average review score for each dining commons.",
     to: "/statistics/commons/averages",
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: Found multiple elements with the text: 

Here are the matching elements:

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:41:17
     description: "Average review score for each dining commons by month.",
     to: "/statistics/commons/overtime",
     testid: "StatisticsIndexPage-commons-overtime",
-    comingSoon: true,
+    comingSoon: false,
   },
   {
killedBy: StatisticsIndexPage tests renders Coming Soon buttons for not-yet-implemented cards
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <a
  class="btn btn-primary"
  data-discover="true"
  data-testid="StatisticsIndexPage-commons-overtime"
  href="/statistics/commons/overtime"
