[Killed] BlockStatement
main/pages/Statistics/WorstItemsPage.jsx:21:33
     [],
   );
 
-  const onChangePeriod = (e) => {
-    setPeriod(e.target.value);
-  };
+  const onChangePeriod = (e) => {};
 
   return (
killedBy: WorstItemsPage tests refetches with the new period when the dropdown changes
statusReason: expect(element).toHaveValue(6M)

Expected the element to have value:
  6M
Received:
  ALL
