[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:18:13
     description:
       "See the highest rated menu items overall and in recent time windows.",
     to: "/statistics/items/best",
-    testid: "StatisticsIndexPage-best-items",
+    testid: "",
     comingSoon: false,
   },
killedBy: StatisticsIndexPage tests exposes the expected list of test ids
statusReason: expected [ '', …(4) ] to deeply equal [ …(5) ]

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:34:17
     description: "Average review score for each dining commons.",
     to: "/statistics/commons/averages",
     testid: "StatisticsIndexPage-commons-averages",
-    comingSoon: false,
+    comingSoon: true,
   },
   {
killedBy: StatisticsIndexPage tests exposes the expected comingSoon flags
statusReason: expected [ false, false, true, false, false ] to deeply equal [ false, false, false, false, false ]

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:41:17
     description: "Average review score for each dining commons by month.",
     to: "/statistics/commons/overtime",
     testid: "StatisticsIndexPage-commons-overtime",
-    comingSoon: false,
+    comingSoon: true,
   },
   {
killedBy: StatisticsIndexPage tests exposes the expected comingSoon flags
statusReason: expected [ false, false, false, true, false ] to deeply equal [ false, false, false, false, false ]
