[Killed] ObjectLiteral
main/pages/Statistics/statisticsConstants.js:43:3
     testid: "StatisticsIndexPage-commons-overtime",
     comingSoon: false,
   },
-  {
-    title: "Meal Averages by Dining Commons",
-    description: "Average review score for each meal at a dining commons.",
-    to: "/statistics/commons/meals",
-    testid: "StatisticsIndexPage-commons-meals",
-    comingSoon: true,
-  },
+  {},
 ];
 
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: It looks like undefined was passed instead of a matcher. Did you do something like getByText(undefined)?
