[Killed] ObjectLiteral
main/pages/Statistics/statisticsConstants.js:29:3
     testid: "StatisticsIndexPage-worst-items",
     comingSoon: false,
   },
-  {
-    title: "Dining Commons Averages",
-    description: "Average review score for each dining commons.",
-    to: "/statistics/commons/averages",
-    testid: "StatisticsIndexPage-commons-averages",
-    comingSoon: true,
-  },
+  {},
   {
     title: "Dining Commons Averages Over Time",
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: It looks like undefined was passed instead of a matcher. Did you do something like getByText(undefined)?

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:34:17
     description: "Average review score for each dining commons.",
     to: "/statistics/commons/averages",
     testid: "StatisticsIndexPage-commons-averages",
-    comingSoon: true,
+    comingSoon: false,
   },
   {
killedBy: StatisticsIndexPage tests exposes the expected comingSoon flags
statusReason: expected [ false, false, false, true, false ] to deeply equal [ false, false, true, true, false ]
