[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:6:12
 /** Cards displayed on the statistics overview page. */
 export const STATISTICS_PAGES = [
   {
-    title: "Best Rated Items",
+    title: "",
     description:
       "See the highest rated menu items overall and in recent time windows.",
killedBy: StatisticsIndexPage tests renders Coming Soon vs View per card based on the comingSoon flag
statusReason: Found multiple elements with the text: 

Here are the matching elements:

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:11:17
       "See the highest rated menu items overall and in recent time windows.",
     to: "/statistics/items/best",
     testid: "StatisticsIndexPage-best-items",
-    comingSoon: true,
+    comingSoon: false,
   },
   {
killedBy: StatisticsIndexPage tests exposes the expected comingSoon flags
statusReason: expected [ false, true, true, true, false ] to deeply equal [ true, true, true, true, false ]

[Killed] ObjectLiteral
main/pages/Statistics/statisticsConstants.js:13:3
     testid: "StatisticsIndexPage-best-items",
     comingSoon: true,
   },
-  {
-    title: "Worst Rated Items",
-    description:
-      "See the lowest rated menu items overall and in recent time windows.",
-    to: "/statistics/items/worst",
-    testid: "StatisticsIndexPage-worst-items",
-    comingSoon: true,
-  },
+  {},
   {
     title: "Dining Commons Averages",
killedBy: StatisticsIndexPage tests renders Coming Soon vs View per card based on the comingSoon flag
statusReason: It looks like undefined was passed instead of a matcher. Did you do something like getByText(undefined)?

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:19:17
       "See the lowest rated menu items overall and in recent time windows.",
     to: "/statistics/items/worst",
     testid: "StatisticsIndexPage-worst-items",
-    comingSoon: true,
+    comingSoon: false,
   },
   {
killedBy: StatisticsIndexPage tests exposes the expected comingSoon flags
statusReason: expected [ true, false, true, true, false ] to deeply equal [ true, true, true, true, false ]

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:30:18
   },
   {
     title: "Dining Commons Averages Over Time",
-    description: "Average review score for each dining commons by month.",
+    description: "",
     to: "/statistics/commons/overtime",
     testid: "StatisticsIndexPage-commons-overtime",
killedBy: StatisticsIndexPage tests renders Coming Soon vs View per card based on the comingSoon flag
statusReason: Found multiple elements with the text: 

Here are the matching elements:

Ignored nodes: comments, script, style
<body>
  <div>
    <div
