[Killed] BlockStatement
main/components/AliasApproval/AliasApprovalTable.jsx:9:4
   approveCallback,
   rejectCallback,
   moderatorOptions,
-}) {
-  const testid = "Aliasapprovaltable";
-
-  const columns = [
-    {
-      Header: "Proposed Alias",
-      accessor: "proposedAlias",
-    },
-  ];
-
-  if (moderatorOptions) {
-    columns.push(ButtonColumn("Approve", "primary", approveCallback, testid));
-    columns.push(ButtonColumn("Reject", "danger", rejectCallback, testid));
-  }
-
-  return (
-    <OurTable
-      data={aliases.filter((user) => user.status === "AWAITING_REVIEW")}
-      columns={columns}
-      testid={testid}
-    />
-  );
-}
+}) {}
 
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: Unable to find an element with the text: Proposed Alias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/AliasApproval/AliasApprovalTable.jsx:14:15
 
   const columns = [
     {
-      Header: "Proposed Alias",
+      Header: "",
       accessor: "proposedAlias",
     },
killedBy: AliasApprovalTable tests renders the header even with no data
statusReason: Unable to find an element with the text: Proposed Alias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/AliasApproval/AliasApprovalTable.jsx:26:38
 
   return (
     <OurTable
-      data={aliases.filter((user) => user.status === "AWAITING_REVIEW")}
+      data={aliases.filter((user) => false)}
       columns={columns}
       testid={testid}
killedBy: AliasApprovalTable tests only renders users with AWAITING_REVIEW status
statusReason: Unable to find an element with the text: vnarasiman. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/AliasApproval/AliasApprovalTable.jsx:26:28
 
   return (
     <OurTable
-      data={aliases.filter((user) => user.status === "AWAITING_REVIEW")}
+      data={aliases.filter(() => undefined)}
       columns={columns}
       testid={testid}
killedBy: AliasApprovalTable tests only renders users with AWAITING_REVIEW status
statusReason: Unable to find an element with the text: vnarasiman. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
