[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:8:5
 export default function DiningCommonsTable({ commons, date }) {
   const testid = "DiningCommonsTable";
   const columns = [
-    {
-      Header: "Code",
-      accessor: "code", // accessor is the "key" in the data
-      Cell: ({ value }) => (
-        <Link to={`/diningcommons/${date}/${value}`}>{value}</Link>
-      ),
-    },
+    {},
     {
       Header: "Name",
killedBy: HomePage tests Renders table with 4 dining commons; DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/DiningCommons/DiningCommonsTable.jsx:22:33
     {
       Header: "Meals Offered Today",
       accessor: "mealsOfferedToday",
-      Cell: ({ value, row }) => {
-        return (
-          <div>
-            {!value || value.length === 0
-              ? "No meals offered today"
-              : value.map((meal) => (
-                  <Link
-                    key={meal.code}
-                    to={`/diningcommons/${date}/${row.original.code}/${meal.code}`}
-                    className="p-2"
-                    data-testid={`DiningCommonsTable-cell-row-${row.index}-col-meal-${meal.code}`}
-                  >
-                    {meal.name}
-                  </Link>
-                ))}
-          </div>
-        );
-      },
+      Cell: ({ value, row }) => {},
     },
     {
killedBy: HomePage meals offered today tests Handles undefined mealsOfferedToday; DiningCommonsTable tests Meals Offered Today renders meal links correctly when there are no meals offered
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  No meals offered today
Received:


Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:25:14
       Cell: ({ value, row }) => {
         return (
           <div>
-            {!value || value.length === 0
+            {value || value.length === 0
               ? "No meals offered today"
               : value.map((meal) => (
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
main/components/DiningCommons/DiningCommonsTable.jsx:25:14
       Cell: ({ value, row }) => {
         return (
           <div>
-            {!value || value.length === 0
+            {true
               ? "No meals offered today"
               : value.map((meal) => (
killedBy: DiningCommonsTable tests Meals Offered Today renders meal links correctly when there are meals offered
statusReason: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
