[Killed] BlockStatement
main/components/MenuItem/MenuItemTable.jsx:8:43
 export default function MenuItemTable({ menuItems, currentUser }) {
   const testid = "MenuItemTable";
   const navigate = useNavigate();
-  const reviewCallback = async (_cell) => {
-    const itemId = _cell.row.original.id;
-    navigate(`/reviews/post/${itemId}`);
-  };
+  const reviewCallback = async (_cell) => {};
 
   const viewCallback = async (_cell) => {
killedBy: MenuItemTable Tests Buttons work correctly
statusReason: expected "vi.fn()" to be called with arguments: [ '/reviews/post/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.jsx:19:48
   };
 
   const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
+    if (!reviews || !Array.isArray(reviews) || reviews.length !== 0)
       return "No reviews";
     const validRatings = reviews
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No reviews

[Killed] BooleanLiteral
main/components/MenuItem/MenuItemTable.jsx:19:21
   };
 
   const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
+    if (!reviews || Array.isArray(reviews) || reviews.length === 0)
       return "No reviews";
     const validRatings = reviews
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No reviews

[Killed] MethodExpression
main/components/MenuItem/MenuItemTable.jsx:21:26
   const calculateAverageRating = (reviews) => {
     if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
       return "No reviews";
-    const validRatings = reviews
-      .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
-      )
+    const validRatings = reviews
       .map((r) => r.itemsStars);
     if (validRatings.length === 0) return "No ratings";
killedBy: MenuItemTable Tests calculateAverageRating handles edge cases correctly
statusReason: Cannot read properties of null (reading 'itemsStars')

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:23:16
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        (r) => true && typeof r.itemsStars === "number",
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests calculateAverageRating handles edge cases correctly
statusReason: Cannot read properties of null (reading 'itemsStars')

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:26:9
         (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
       )
       .map((r) => r.itemsStars);
-    if (validRatings.length === 0) return "No ratings";
+    if (false) return "No ratings";
     const avg = validRatings.reduce((a, b) => a + b, 0) / validRatings.length;
     return avg.toFixed(1);
killedBy: MenuItemTable Tests calculateAverageRating handles edge cases correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  No ratings
Received:
  NaN

[Killed] ArithmeticOperator
main/components/MenuItem/MenuItemTable.jsx:27:17
       )
       .map((r) => r.itemsStars);
     if (validRatings.length === 0) return "No ratings";
-    const avg = validRatings.reduce((a, b) => a + b, 0) / validRatings.length;
+    const avg = validRatings.reduce((a, b) => a + b, 0) * validRatings.length;
     return avg.toFixed(1);
   };
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  18.0

[Killed] ArrayDeclaration
main/components/MenuItem/MenuItemTable.jsx:31:19
     return avg.toFixed(1);
   };
 
-  const columns = [
-    {
-      Header: "Item Name",
-      accessor: "name",
-    },
-    {
-      Header: "Station",
-      accessor: "station",
-    },
-    {
-      Header: "Average Rating",
-      accessor: (row) => calculateAverageRating(row.reviews),
-      id: "averageRating",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_USER")) {
killedBy: MenuItemTable Tests Headers appear and empty table renders correctly without buttons
statusReason: Unable to find an element by: [data-testid="MenuItemTable-header-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/MenuItem/MenuItemTable.jsx:42:17
     },
     {
       Header: "Average Rating",
-      accessor: (row) => calculateAverageRating(row.reviews),
+      accessor: () => undefined,
       id: "averageRating",
     },
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.jsx:47:7
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_USER")) {
+  if (false) {
     columns.push(
       ButtonColumn("Review Item", "warning", reviewCallback, testid),
killedBy: MenuItemTable Tests Navigation uses correct menu item id
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-All Reviews-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
