[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:4:39
 import React, { useEffect } from "react";
 import { Form, Button } from "react-bootstrap";
 
-function dateTimeLocalValue(dateTime) {
-  return dateTime
-    ? dateTime.slice(0, 16)
-    : new Date().toISOString().slice(0, 16);
-}
+function dateTimeLocalValue(dateTime) {}
 
 export default function ReviewForm({
killedBy: ReviewForm tests renders provided initial values and trims datetime-local seconds
statusReason: expect(element).toHaveValue(2024-04-01T12:34)

Expected the element to have value:
  2024-04-01T12:34
Received:

[Killed] MethodExpression
main/components/MyReviews/ReviewForm.jsx:7:7
 function dateTimeLocalValue(dateTime) {
   return dateTime
     ? dateTime.slice(0, 16)
-    : new Date().toISOString().slice(0, 16);
+    : new Date().toISOString();
 }
 
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] ArrowFunction
main/components/MyReviews/ReviewForm.jsx:20:54
 }) {
   const [comments, setComments] = React.useState(initialComments);
   const [stars, setStars] = React.useState(initialStars);
-  const [dateServed, setDateServed] = React.useState(() =>
-    dateTimeLocalValue(initialDateServed),
+  const [dateServed, setDateServed] = React.useState(() => undefined,
   );
 
killedBy: MyReviewsCreatePage - full coverage tests renders form fields with expected defaults
statusReason: expected '' not to be '' // Object.is equality

[Killed] BlockStatement
main/components/MyReviews/ReviewForm.jsx:27:28
   useEffect(() => {
     setComments(initialComments);
     setStars(initialStars);
-    if (initialDateServed) {
-      setDateServed(dateTimeLocalValue(initialDateServed));
-    }
+    if (initialDateServed) {}
   }, [initialComments, initialDateServed, initialStars]);
 
killedBy: ReviewForm tests updates form state when initial values change
statusReason: expect(element).toHaveValue(2024-04-02T13:45)

Expected the element to have value:
  2024-04-02T13:45
Received:
  2024-04-03T16:20

[Killed] ConditionalExpression
main/components/MyReviews/ReviewForm.jsx:27:9
   useEffect(() => {
     setComments(initialComments);
     setStars(initialStars);
-    if (initialDateServed) {
+    if (true) {
       setDateServed(dateTimeLocalValue(initialDateServed));
     }
killedBy: ReviewForm tests does not overwrite the current date when no new initial date is provided
statusReason: expect(element).toHaveValue(2024-04-03T16:20)

Expected the element to have value:
  2024-04-03T16:20
Received:
  2026-05-26T18:08

[Killed] ArrowFunction
main/components/MyReviews/ReviewForm.jsx:60:21
           as="textarea"
           rows={3}
           value={comments}
-          onChange={(e) => setComments(e.target.value)}
+          onChange={() => undefined}
         />
       </Form.Group>
killedBy: EditReviewPage tests submits edited review and navigates back on success; MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected { itemStars: 5, …(2) } to deeply equal { itemStars: 5, …(2) }

[Killed] ArrowFunction
main/components/MyReviews/ReviewForm.jsx:71:32
           value={stars}
           onChange={(e) => setStars(Number(e.target.value))}
         >
-          {[1, 2, 3, 4, 5].map((num) => (
-            <option key={num} value={num}>
-              {num}
-            </option>
-          ))}
+          {[1, 2, 3, 4, 5].map(() => undefined)}
         </Form.Select>
       </Form.Group>
killedBy: ReviewForm tests renders provided initial values and trims datetime-local seconds
statusReason: expect(element).toHaveValue(4)

Expected the element to have value:
  4
Received:
  undefined
