[Survived] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:19:66
   moderatorOptions,
 }) {
   const navigate = useNavigate();
-  const [showModerationModal, setShowModerationModal] = useState(false);
+  const [showModerationModal, setShowModerationModal] = useState(true);
   const [pendingCell, setPendingCell] = useState(null);
   const [moderationStatus, setModerationStatus] = useState(null);

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:130:30
   if (userOptions) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, "Reviewstable"));
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "Reviewstable"),
+      ButtonColumn("Delete", "", deleteCallback, "Reviewstable"),
     );
   }
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:136:59
 
   if (moderatorOptions) {
     columns.push(
-      ButtonColumn("Approve", "primary", approveCallback, "Reviewstable"),
+      ButtonColumn("Approve", "primary", approveCallback, ""),
     );
     columns.push(
killedBy: ReviewsTable tests Moderator buttons appear and work properly; ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:145:58
 
   return (
     <>
-      <OurTable data={reviews} columns={columns} testid={"Reviewstable"} />
+      <OurTable data={reviews} columns={columns} testid={""} />
       <ModerationModal
         show={showModerationModal}
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator; ReviewsTable tests Has the base column headers and content
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/components/Reviews/ReviewsTable.jsx:153:17
         moderatorComments={moderatorComments}
         onModeratorCommentsChange={setModeratorComments}
         onSubmit={handleModerationSubmit}
-        review={pendingCell?.row.original}
+        review={pendingCell.row.original}
       />
     </>
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator
statusReason: Cannot read properties of null (reading 'row')
