[Killed] LogicalOperator
main/components/Users/RoleEmailForm.jsx:36:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.email && "A valid email is required."}
+          {errors.email || "A valid email is required."}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RoleEmailForm tests requires a valid email
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document
