[Killed] BlockStatement
main/components/Users/UsersTable.jsx:7:46
 import { toast } from "react-toastify";
 import PropTypes from "prop-types";
 
-const formatApprovalDate = (dateApproved) => {
-  if (typeof dateApproved !== "string") {
-    return null;
-  }
-
-  const dateParts = dateApproved.split("-");
-  const yearString = dateParts[0];
-  const monthString = dateParts[1];
-  const dayString = dateParts[2];
-  const year = Number(yearString);
-  const month = Number(monthString);
-  const day = Number(dayString);
-  const date = new Date(Date.UTC(year, month - 1, day));
-
-  if (Number.isNaN(date.getTime())) {
-    return null;
-  }
-
-  if (date.toISOString().slice(0, 10) !== dateApproved) {
-    return null;
-  }
-
-  return `${month}/${day}/${year}`;
-};
+const formatApprovalDate = (dateApproved) => {};
 
 const columns = [
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:8:7
 import PropTypes from "prop-types";
 
 const formatApprovalDate = (dateApproved) => {
-  if (typeof dateApproved !== "string") {
+  if (true) {
     return null;
   }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:8:7
 import PropTypes from "prop-types";
 
 const formatApprovalDate = (dateApproved) => {
-  if (typeof dateApproved !== "string") {
+  if (typeof dateApproved === "string") {
     return null;
   }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Cannot read properties of null (reading 'split')

[Killed] ArithmeticOperator
main/components/Users/UsersTable.jsx:19:40
   const year = Number(yearString);
   const month = Number(monthString);
   const day = Number(dayString);
-  const date = new Date(Date.UTC(year, month - 1, day));
+  const date = new Date(Date.UTC(year, month + 1, day));
 
   if (Number.isNaN(date.getTime())) {
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:21:37
   const day = Number(dayString);
   const date = new Date(Date.UTC(year, month - 1, day));
 
-  if (Number.isNaN(date.getTime())) {
-    return null;
-  }
+  if (Number.isNaN(date.getTime())) {}
 
   if (date.toISOString().slice(0, 10) !== dateApproved) {
killedBy: UserTable tests renders without crashing for three users
statusReason: Invalid time value

[Killed] MethodExpression
main/components/Users/UsersTable.jsx:25:7
     return null;
   }
 
-  if (date.toISOString().slice(0, 10) !== dateApproved) {
+  if (date.toISOString() !== dateApproved) {
     return null;
   }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Users/UsersTable.jsx:69:24
   },
   {
     Header: "Status",
-    accessor: (row) => {
-      if (row.status === "APPROVED") {
-        const formattedDate = formatApprovalDate(row.dateApproved);
-        if (!formattedDate) {
-          return row.status;
-        }
-        return `Approved on ${formattedDate}`;
-      }
-      return row.status;
-    },
+    accessor: (row) => {},
   },
 ];
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] EqualityOperator
main/components/Users/UsersTable.jsx:70:11
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "APPROVED") {
+      if (row.status !== "APPROVED") {
         const formattedDate = formatApprovalDate(row.dateApproved);
         if (!formattedDate) {
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:70:11
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "APPROVED") {
+      if (true) {
         const formattedDate = formatApprovalDate(row.dateApproved);
         if (!formattedDate) {
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: REJECTED. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/Users/UsersTable.jsx:72:13
     accessor: (row) => {
       if (row.status === "APPROVED") {
         const formattedDate = formatApprovalDate(row.dateApproved);
-        if (!formattedDate) {
+        if (formattedDate) {
           return row.status;
         }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Users/UsersTable.jsx:72:13
     accessor: (row) => {
       if (row.status === "APPROVED") {
         const formattedDate = formatApprovalDate(row.dateApproved);
-        if (!formattedDate) {
+        if (false) {
           return row.status;
         }
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: APPROVED. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:75:16
         if (!formattedDate) {
           return row.status;
         }
-        return `Approved on ${formattedDate}`;
+        return ``;
       }
       return row.status;
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:84:5
 
 export default function UsersTable({ users, showToggleButtons = false }) {
   const toggleAdminMutation = useBackendMutation(
-    (cell) => ({
-      url: "/api/admin/toggleAdmin",
-      method: "PUT",
-      params: {
-        id: cell.row.values.id,
-      },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: UserTable tests Clicking Toggle Admin calls the toggleAdmin endpoint
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:91:5
         id: cell.row.values.id,
       },
     }),
-    {
-      onSuccess: () => {
-        toast("Admin status toggled");
-      },
-    },
+    {},
     ["/api/admin/users"],
   );
killedBy: UserTable tests useBackendMutation is configured to refresh admin users after toggles
statusReason: expected 1st "vi.fn()" call to have been called with [ Any<Function>, …(2) ]

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:107:5
         id: cell.row.values.id,
       },
     }),
-    {
-      onSuccess: () => {
-        toast("Moderator status toggled");
-      },
-    },
+    {},
     ["/api/admin/users"],
   );
killedBy: UserTable tests useBackendMutation is configured to refresh admin users after toggles
statusReason: expected 2nd "vi.fn()" call to have been called with [ Any<Function>, …(2) ]

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:112:6
         toast("Moderator status toggled");
       },
     },
-    ["/api/admin/users"],
+    [""],
   );
 
killedBy: UserTable tests useBackendMutation is configured to refresh admin users after toggles
statusReason: expected 2nd "vi.fn()" call to have been called with [ Any<Function>, …(2) ]

[Killed] ObjectLiteral
main/components/Users/UsersTable.jsx:115:29
     ["/api/admin/users"],
   );
 
-  const toggleAdminColumn = {
-    Header: "Toggle Admin",
-    id: "toggle-admin",
-    Cell: (cell) => (
-      <Button
-        variant="primary"
-        onClick={() => toggleAdminMutation.mutate(cell)}
-        data-testid={`UsersTable-cell-row-${cell.row.index}-col-toggle-admin-button`}
-      >
-        Toggle Admin
-      </Button>
-    ),
-  };
+  const toggleAdminColumn = {};
 
   const toggleModeratorColumn = {
killedBy: AdminUsersPage tests renders without crashing on three users; UserTable tests shows toggle columns and buttons when enabled
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.jsx:130:13
   };
 
   const toggleModeratorColumn = {
-    Header: "Toggle Moderator",
+    Header: "",
     id: "toggle-moderator",
     Cell: (cell) => (
killedBy: UserTable tests shows toggle columns and buttons when enabled
statusReason: Unable to find an accessible element with the role "columnheader" and name "Toggle Moderator"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ArrowFunction
main/components/Users/UsersTable.jsx:132:11
   const toggleModeratorColumn = {
     Header: "Toggle Moderator",
     id: "toggle-moderator",
-    Cell: (cell) => (
-      <Button
-        variant="primary"
-        onClick={() => toggleModeratorMutation.mutate(cell)}
-        data-testid={`UsersTable-cell-row-${cell.row.index}-col-toggle-moderator-button`}
-      >
-        Toggle Moderator
-      </Button>
-    ),
+    Cell: () => undefined,
   };
 
killedBy: UserTable tests shows toggle columns and buttons when enabled; AdminUsersPage tests renders users table with data
statusReason: Unable to find an accessible element with the role "button" and name "Toggle Moderator"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<td
  data-testid="UsersTabl
