[Killed] BlockStatement
src/main/pages/HomePage.jsx:25:27
   };
   const queries = [];
   if (Array.isArray(data)) {
-    for (const d of data) {
-      queries.push({
-        queryKey: ["meals", d.code, selectedDate],
-        queryFn: () =>
-          axios
-            .get(`/api/diningcommons/${selectedDate}/${d.code}`)
-            .then((res) => res.data),
-      });
-    }
+    for (const d of data) {}
   }
   const mealsOffered = useQueries(queries);
killedBy: HomePage meals offered today tests Query key must be 'meals'
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
src/main/pages/HomePage.jsx:31:19
         queryFn: () =>
           axios
             .get(`/api/diningcommons/${selectedDate}/${d.code}`)
-            .then((res) => res.data),
+            .then(() => undefined),
       });
     }
killedBy: HomePage meals offered today tests Renders correctly with mealsOfferedToday
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Breakfast
Received:
  No meals offered today

Ignored nodes: comments, script, style

[Killed] OptionalChaining
src/main/pages/HomePage.jsx:40:28
   const combined = Array.isArray(data)
     ? data.map((d, i) => ({
         ...d,
-        mealsOfferedToday: mealsOffered[i]?.data ?? [],
+        mealsOfferedToday: mealsOffered[i].data ?? [],
       }))
     : // Stryker disable next-line all : default empty array when dining data is missing
killedBy: HomePage meals offered today tests Optional chaining handles sparse arrays where element is missing
statusReason: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
