[Killed] ConditionalExpression
main/pages/Meal/MealTimesPage.jsx:29:7
     navigate(`/diningcommons/${newDate}/${diningCommonsCode}`);
   };
 
-  if (status === 204) {
+  if (true) {
     const message = `${diningCommonsCode} is closed on ${dateTime}. Please select another date or dining common.`;
     toast(message, { toastId: "closed-dining-commons" });
killedBy: MealTimesPage tests displays correct information in the table
statusReason: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
