[Killed] BlockStatement
src/main/pages/ModerateAliasesPage.jsx:51:38
   //
   // Callbacks (just trigger the mutations)
   //
-  const approveCallback = (alias) => {
-    approveMutation.mutate(alias);
-  };
+  const approveCallback = (alias) => {};
 
   const rejectCallback = (alias) => {
killedBy: ModerateAliases Page Tests approve button calls mutation and shows success for correct data
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/ModerateAliasesPage.jsx:55:37
     approveMutation.mutate(alias);
   };
 
-  const rejectCallback = (alias) => {
-    rejectMutation.mutate(alias);
-  };
+  const rejectCallback = (alias) => {};
 
   const moderateAliasesOptions =
killedBy: ModerateAliases Page Tests reject button calls mutation and shows success for correct data
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/ModerateAliasesPage.jsx:60:5
   };
 
   const moderateAliasesOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    true;
 
   return (
killedBy: ModerateAliases Page Tests does NOT render approve/reject buttons for regular user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="Aliasapprovaltable-cell-row-0-col-Approve-button"
  type="button"
>
  Approve
