[Killed] ObjectLiteral
src/main/pages/ModerateReviewsPage.jsx:42:5
 
   const approveAliasMutation = useBackendMutation(
     cellToAxiosParamsApprove,
-    { onSuccess: onModerateSuccess },
+    {},
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/users/needsmoderation"],
killedBy: ModerateReviews Page Tests approve alias button calls mutation and shows success
statusReason: expected "vi.fn()" to be called with arguments: [ 'Moderation success' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/pages/ModerateReviewsPage.jsx:49:5
 
   const rejectAliasMutation = useBackendMutation(
     cellToAxiosParamsReject,
-    { onSuccess: onModerateSuccess },
+    {},
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/admin/users/needsmoderation"],
killedBy: ModerateReviews Page Tests reject alias button calls mutation and shows success
statusReason: expected "vi.fn()" to be called with arguments: [ 'Moderation success' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/main/pages/ModerateReviewsPage.jsx:63:5
   };
 
   const moderateReviewsOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_MODERATOR");
+    false;
 
   return (
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for moderator
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/ModerateReviewsPage.jsx:63:26
   };
 
   const moderateReviewsOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
+    hasRole(currentUser, "") ||
     hasRole(currentUser, "ROLE_MODERATOR");
 
killedBy: ModerateReviews Page Tests renders reviews with approve/reject buttons for admin
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
