[Killed] StringLiteral
main/pages/Reviews/EditReviewPage.jsx:13:6
   const navigate = useNavigate();
 
   const { data: review } = useBackend(
-    [`/api/reviews/${id}`],
+    [``],
     // Stryker disable next-line all
     {
killedBy: EditReviewPage tests fetches a different review when the route id changes
statusReason: Unable to find an element with the text: Loading review.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
  <div>
    <div
      class="d-flex flex-column min-vh-100"

[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:23:44
     },
   );
 
-  const submitReview = async (formData) => {
-    try {
-      await axios.put(
-        "/api/reviews/reviewer",
-        {
-          itemStars: formData.itemsStars,
-          reviewerComments: formData.reviewerComments,
-          dateItemServed: formData.dateItemServed,
-        },
-        {
-          params: {
-            id,
-          },
-        },
-      );
-      toast(`Review ${id} updated`);
-      navigate(-1);
-    } catch (err) {
-      let errorMessage = err.message;
-      if (err.response && err.response.data && err.response.data.error) {
-        errorMessage = err.response.data.error;
-      }
-      toast.error(`Error updating review: ${errorMessage}`);
-    }
-  };
+  const submitReview = async (formData) => {};
 
   return (
killedBy: EditReviewPage tests submits edited review and navigates back on success
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:24:9
   );
 
   const submitReview = async (formData) => {
-    try {
-      await axios.put(
-        "/api/reviews/reviewer",
-        {
-          itemStars: formData.itemsStars,
-          reviewerComments: formData.reviewerComments,
-          dateItemServed: formData.dateItemServed,
-        },
-        {
-          params: {
-            id,
-          },
-        },
-      );
-      toast(`Review ${id} updated`);
-      navigate(-1);
-    } catch (err) {
+    try {} catch (err) {
       let errorMessage = err.message;
       if (err.response && err.response.data && err.response.data.error) {
killedBy: EditReviewPage tests submits edited review and navigates back on success
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:42:11
       navigate(-1);
     } catch (err) {
       let errorMessage = err.message;
-      if (err.response && err.response.data && err.response.data.error) {
+      if (false) {
         errorMessage = err.response.data.error;
       }
killedBy: EditReviewPage tests shows server error message when update fails with an error field
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Error updating review: Items stars must be between 1 and 5.",

[Killed] BlockStatement
main/pages/Reviews/EditReviewPage.jsx:42:73
       navigate(-1);
     } catch (err) {
       let errorMessage = err.message;
-      if (err.response && err.response.data && err.response.data.error) {
-        errorMessage = err.response.data.error;
-      }
+      if (err.response && err.response.data && err.response.data.error) {}
       toast.error(`Error updating review: ${errorMessage}`);
     }
killedBy: EditReviewPage tests shows server error message when update fails with an error field
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Error updating review: Items stars must be between 1 and 5.",

[Killed] ConditionalExpression
main/pages/Reviews/EditReviewPage.jsx:53:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Review</h1>
-        {!review || !review.item ? (
+        {false ? (
           <p>Loading review...</p>
         ) : (
killedBy: EditReviewPage tests loads the review into the edit form
statusReason: Cannot read properties of undefined (reading 'item')
