[Killed] BlockStatement
main/pages/Reviews/PostReviewPage.jsx:29:44
 
   const itemName = menuItems.name;
 
-  const submitReview = async (formData) => {
-    try {
-      await axios.post("/api/reviews/post", null, {
-        params: {
-          itemId: id,
-          reviewerComments: formData.reviewerComments,
-          itemsStars: formData.itemsStars,
-          dateItemServed: formData.dateItemServed,
-        },
-      });
-      // Stryker disable next-line all : itemName will be defined
-      toast(`Review submitted for ${itemName}`);
-      navigate(-1);
-    } catch (err) {
-      toast.error(
-        `Error submitting review: ${err.response?.data?.error || err.message}`,
-      );
-    }
-  };
+  const submitReview = async (formData) => {};
 
   return (
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Reviews/PostReviewPage.jsx:30:9
   const itemName = menuItems.name;
 
   const submitReview = async (formData) => {
-    try {
-      await axios.post("/api/reviews/post", null, {
-        params: {
-          itemId: id,
-          reviewerComments: formData.reviewerComments,
-          itemsStars: formData.itemsStars,
-          dateItemServed: formData.dateItemServed,
-        },
-      });
-      // Stryker disable next-line all : itemName will be defined
-      toast(`Review submitted for ${itemName}`);
-      navigate(-1);
-    } catch (err) {
+    try {} catch (err) {
       toast.error(
         `Error submitting review: ${err.response?.data?.error || err.message}`,
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] LogicalOperator
main/pages/Reviews/PostReviewPage.jsx:44:37
       navigate(-1);
     } catch (err) {
       toast.error(
-        `Error submitting review: ${err.response?.data?.error || err.message}`,
+        `Error submitting review: ${err.response?.data?.error && err.message}`,
       );
     }
killedBy: MyReviewsCreatePage - full coverage tests shows error toast on network error during post with fallback message
statusReason: Unable to find an element with the text: /Error submitting review: timeout of 0ms exceeded/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Reviews/PostReviewPage.jsx:44:37
       navigate(-1);
     } catch (err) {
       toast.error(
-        `Error submitting review: ${err.response?.data?.error || err.message}`,
+        `Error submitting review: ${err.response.data?.error || err.message}`,
       );
     }
killedBy: MyReviewsCreatePage - full coverage tests shows error toast on network error during post with fallback message
statusReason: Unable to find an element with the text: /Error submitting review: timeout of 0ms exceeded/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
