[Killed] ObjectLiteral
src/main/utils/Aliases.jsx:3:52
 import { toast } from "react-toastify";
 
-export const cellToAxiosParamsApprove = (cell) => ({
-  method: "PUT",
-  url: "/api/currentUser/updateAliasModeration",
-  params: {
-    id: cell.row.original.id,
-    approved: true,
-    proposedAlias: cell.row.original.proposedAlias,
-  },
-});
+export const cellToAxiosParamsApprove = (cell) => ({});
 
 export const cellToAxiosParamsReject = (cell) => ({
killedBy: Aliases Utils cellToAxiosParamsApprove returns the correct params for APPROVED
statusReason: expected {} to deeply equal { …(3) }

[Killed] BooleanLiteral
src/main/utils/Aliases.jsx:8:15
   url: "/api/currentUser/updateAliasModeration",
   params: {
     id: cell.row.original.id,
-    approved: true,
+    approved: false,
     proposedAlias: cell.row.original.proposedAlias,
   },
killedBy: Aliases Utils cellToAxiosParamsApprove returns the correct params for APPROVED
statusReason: expected { method: 'PUT', …(2) } to deeply equal { …(3) }

[Killed] ObjectLiteral
src/main/utils/Aliases.jsx:16:11
 export const cellToAxiosParamsReject = (cell) => ({
   method: "PUT",
   url: "/api/currentUser/updateAliasModeration",
-  params: {
-    id: cell.row.original.id,
-    approved: false,
-    proposedAlias: cell.row.original.proposedAlias,
-  },
+  params: {},
 });
 
killedBy: Aliases Utils cellToAxiosParamsReject returns the correct params for REJECTED
statusReason: expected { method: 'PUT', …(2) } to deeply equal { …(3) }

[Killed] BooleanLiteral
src/main/utils/Aliases.jsx:18:15
   url: "/api/currentUser/updateAliasModeration",
   params: {
     id: cell.row.original.id,
-    approved: false,
+    approved: true,
     proposedAlias: cell.row.original.proposedAlias,
   },
killedBy: Aliases Utils cellToAxiosParamsReject returns the correct params for REJECTED
statusReason: expected { method: 'PUT', …(2) } to deeply equal { …(3) }

[Killed] BlockStatement
src/main/utils/Aliases.jsx:23:37
   },
 });
 
-export function onModerateSuccess() {
-  console.log("Moderation success");
-  toast("Moderation success");
-}
+export function onModerateSuccess() {}
 
killedBy: Aliases Utils onModerateSuccess It puts the message on console.log and in a toast
statusReason: expected "log" to be called with arguments: [ 'Moderation success' ]

Number of calls: 0
