[Killed] BlockStatement
src/main/utils/Reviews.jsx:22:3
   cell,
   status,
   moderatorComments = "",
-) {
-  return {
-    url: "/api/reviews/moderate",
-    method: "PUT",
-    params: {
-      id: cell.row.original.id,
-      status: status,
-      moderatorComments: moderatorComments,
-    },
-  };
-}
+) {}
 
 export function onModerateSuccess() {
killedBy: Reviews cellToAxiosParamsModerate It returns the correct params for APPROVED
statusReason: expected undefined to deeply equal { url: '/api/reviews/moderate', …(2) }
