[Killed] BlockStatement
src/main/utils/currentUser.jsx:5:34
 import axios from "axios";
 import { useNavigate } from "react-router";
 
-export function useCurrentUser() {
-  let rolesList = ["ERROR_GETTING_ROLES"];
-  return useQuery(
-    "current user",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        throw e;
-      }
-    },
-    {
-      initialData: { loggedIn: false, root: null, initialData: true },
-    },
-  );
-}
+export function useCurrentUser() {}
 
 export function useLogout() {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data; HomePage tests Renders table with 4 dining commons
statusReason: Cannot read properties of undefined (reading 'isSuccess')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/currentUser.jsx:9:17
   let rolesList = ["ERROR_GETTING_ROLES"];
   return useQuery(
     "current user",
-    async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        try {
-          rolesList = response.data.roles.map((r) => r.authority);
-        } catch (e) {
-          console.error("Error getting roles: ", e);
-        }
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        throw e;
-      }
-    },
+    async () => {},
     {
       initialData: { loggedIn: false, root: null, initialData: true },
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data; ProfilePage tests renders correctly for regular logged in user
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/currentUser.jsx:19:19
         }
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
-      } catch (e) {
-        console.error("Error invoking axios.get: ", e);
-        throw e;
-      }
+      } catch (e) {}
     },
     {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser retrieves initial data
statusReason: expected undefined to deeply equal { loggedIn: false, root: null, …(1) }

[Killed] OptionalChaining
src/main/utils/currentUser.jsx:50:7
 
   if (currentUser == null) return false;
 
-  if (currentUser.data?.root?.rolesList) {
+  if (currentUser.data.root?.rolesList) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: AdminUsersPage tests renders without crashing on three users; StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: Cannot read properties of undefined (reading 'root')
