[Killed] BlockStatement
src/main/utils/useBackend.jsx:31:17
 export function useBackend(queryKey, axiosParameters, initialData) {
   const query = useQuery(
     queryKey,
-    async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return { data: response.data, status: response.status };
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        console.error(errorMessage, e);
-        toast(errorMessage);
-        throw e;
-      }
-    },
+    async () => {},
     {
       initialData:
killedBy: AdminUsersPage tests renders empty table when backend unavailable; HomePage tests Renders table with 4 dining commons
statusReason: expected 'The above error occurred in the <OurT…' to match 'Error communicating with backend via …'

[Killed] BlockStatement
src/main/utils/useBackend.jsx:32:11
   const query = useQuery(
     queryKey,
     async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return { data: response.data, status: response.status };
-      } catch (e) {
+      try {} catch (e) {
         const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
         console.error(errorMessage, e);
killedBy: HomePage tests Renders table with 4 dining commons
statusReason: expected "error" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useBackend.jsx:35:19
       try {
         const response = await axios(axiosParameters);
         return { data: response.data, status: response.status };
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        console.error(errorMessage, e);
-        toast(errorMessage);
-        throw e;
-      }
+      } catch (e) {}
     },
     {
killedBy: AdminUsersPage tests renders empty table when backend unavailable; HomePage renders properly with no backend Renders without crashing with no backend
statusReason: expected 'Warning: Each child in a list should …' to match 'Error communicating with backend via …'

[Killed] EqualityOperator
src/main/utils/useBackend.jsx:44:9
     },
     {
       initialData:
-        initialData !== undefined
+        initialData === undefined
           ? { data: initialData, status: 200 }
           : undefined,
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: expected undefined to deeply equal [ 'initialData' ]

[Timeout] ConditionalExpression
src/main/utils/useBackend.jsx:44:9
     },
     {
       initialData:
-        initialData !== undefined
+        true
           ? { data: initialData, status: 200 }
           : undefined,

[Killed] OptionalChaining
src/main/utils/useBackend.jsx:52:11
 
   return {
     ...query,
-    data: query.data?.data,
+    data: query.data.data,
     status: query.data?.status,
   };
killedBy: MealTimesPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] OptionalChaining
src/main/utils/useBackend.jsx:53:13
   return {
     ...query,
     data: query.data?.data,
-    status: query.data?.status,
+    status: query.data.status,
   };
 }
killedBy: MealTimesPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'status')
