[Killed] EqualityOperator
main/components/Moderation/ModerationModal.jsx:13:17
   onSubmit,
   review,
 }) {
-  const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
+  const title = status !== "APPROVED" ? "Approve Review" : "Reject Review";
   const actionText = status === "APPROVED" ? "Approve" : "Reject";
   const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
killedBy: ModerationModal tests renders approve modal with review details and disabled submit when comments are empty
statusReason: Unable to find an element with the text: Approve Review. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:13:17
   onSubmit,
   review,
 }) {
-  const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
+  const title = true ? "Approve Review" : "Reject Review";
   const actionText = status === "APPROVED" ? "Approve" : "Reject";
   const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
killedBy: ModerationModal tests renders reject modal with comment input and calls submit callback
statusReason: Unable to find an element with the text: Reject Review. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:14:22
   review,
 }) {
   const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
-  const actionText = status === "APPROVED" ? "Approve" : "Reject";
+  const actionText = false ? "Approve" : "Reject";
   const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
 
killedBy: ModerationModal tests renders approve and reject buttons with correct bootstrap variants
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Approve
Received:
  Reject

[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:14:22
   review,
 }) {
   const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
-  const actionText = status === "APPROVED" ? "Approve" : "Reject";
+  const actionText = true ? "Approve" : "Reject";
   const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
 
killedBy: ModerationModal tests renders approve and reject buttons with correct bootstrap variants
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Reject
Received:
  Approve

[Killed] EqualityOperator
main/components/Moderation/ModerationModal.jsx:15:22
 }) {
   const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
   const actionText = status === "APPROVED" ? "Approve" : "Reject";
-  const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
+  const actionVerb = status !== "APPROVED" ? "approving" : "rejecting";
 
   return (
killedBy: ModerationModal tests renders approve modal with review details and disabled submit when comments are empty
statusReason: Unable to find an element with the text: /Please add moderator comments before approving this review\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-

[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:15:22
 }) {
   const title = status === "APPROVED" ? "Approve Review" : "Reject Review";
   const actionText = status === "APPROVED" ? "Approve" : "Reject";
-  const actionVerb = status === "APPROVED" ? "approving" : "rejecting";
+  const actionVerb = false ? "approving" : "rejecting";
 
   return (
killedBy: ModerationModal tests renders approve modal with review details and disabled submit when comments are empty
statusReason: Unable to find an element with the text: /Please add moderator comments before approving this review\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-

[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:35:10
             data-testid="moderation-modal-comments"
           />
         </Form.Group>
-        {review && (
-          <div className="mt-3">
-            <strong>Review ID:</strong> {review.id}
-            <br />
-            <strong>Item:</strong> {review.item?.name ?? "Unknown"}
-          </div>
-        )}
+        {true}
       </Modal.Body>
       <Modal.Footer>
killedBy: ModerationModal tests renders approve modal with review details and disabled submit when comments are empty
statusReason: Unable to find an element with the text: /Review ID:/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/components/Moderation/ModerationModal.jsx:35:10
             data-testid="moderation-modal-comments"
           />
         </Form.Group>
-        {review && (
-          <div className="mt-3">
-            <strong>Review ID:</strong> {review.id}
-            <br />
-            <strong>Item:</strong> {review.item?.name ?? "Unknown"}
-          </div>
-        )}
+        {review || <div className="mt-3">
+            <strong>Review ID:</strong> {review.id}
+            <br />
+            <strong>Item:</strong> {review.item?.name ?? "Unknown"}
+          </div>}
       </Modal.Body>
       <Modal.Footer>
killedBy: ModerationModal tests renders approve modal with review details and disabled submit when comments are empty
statusReason: Objects are not valid as a React child (found: object with keys {id, item}). If you meant to render a collection of children, use an array instead.

[Killed] OptionalChaining
main/components/Moderation/ModerationModal.jsx:39:37
           <div className="mt-3">
             <strong>Review ID:</strong> {review.id}
             <br />
-            <strong>Item:</strong> {review.item?.name ?? "Unknown"}
+            <strong>Item:</strong> {review.item.name ?? "Unknown"}
           </div>
         )}
killedBy: ModerationModal tests shows Unknown when review item is missing
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] EqualityOperator
main/components/Moderation/ModerationModal.jsx:48:20
           Cancel
         </Button>
         <Button
-          variant={status === "APPROVED" ? "primary" : "danger"}
+          variant={status !== "APPROVED" ? "primary" : "danger"}
           onClick={onSubmit}
           disabled={!moderatorComments.trim()}
killedBy: ModerationModal tests renders reject modal with comment input and calls submit callback
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn btn-primary

[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:48:20
           Cancel
         </Button>
         <Button
-          variant={status === "APPROVED" ? "primary" : "danger"}
+          variant={true ? "primary" : "danger"}
           onClick={onSubmit}
           disabled={!moderatorComments.trim()}
killedBy: ModerationModal tests renders reject modal with comment input and calls submit callback
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn btn-primary

[Killed] MethodExpression
main/components/Moderation/ModerationModal.jsx:50:22
         <Button
           variant={status === "APPROVED" ? "primary" : "danger"}
           onClick={onSubmit}
-          disabled={!moderatorComments.trim()}
+          disabled={!moderatorComments}
           data-testid="moderation-modal-submit"
         >
killedBy: ModerationModal tests disables submit for whitespace-only comments and shows active Approve text
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-primary"
  data-testid="moderation-modal-submit"
  type="button"
/>
