[Killed] StringLiteral
main/components/Nav/Footer.jsx:7:40
   return (
     <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5" data-testid="Footer">
       <Container>
-        This app is a class project of{" "}
+        This app is a class project of{""}
         <a
           data-testid="footer-class-website-link"
killedBy: ModerateAliases Page Tests approve button calls mutation and shows success for correct data
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
