[Killed] StringLiteral
main/components/Statistics/CommonsAveragesOverTimeTable.jsx:10:15
 }) {
   const columns = [
     {
-      Header: "Dining Commons",
+      Header: "",
       accessor: "diningCommonsCode",
     },
killedBy: CommonsAveragesOverTimeTable tests renders headers
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Dining Commons
Received:

[Killed] ArrowFunction
main/components/Statistics/CommonsAveragesOverTimeTable.jsx:20:13
     {
       Header: "Average Score",
       accessor: "averageStars",
-      Cell: ({ value }) => value.toFixed(2),
+      Cell: () => undefined,
     },
     {
killedBy: CommonsAveragesOverTimeTable tests renders all rows
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.20
Received:

[Killed] ObjectLiteral
main/components/Statistics/CommonsAveragesOverTimeTable.jsx:22:5
       accessor: "averageStars",
       Cell: ({ value }) => value.toFixed(2),
     },
-    {
-      Header: "Reviews",
-      accessor: "reviewCount",
-    },
+    {},
   ];
 
killedBy: CommonsAveragesOverTimeTable tests renders all rows
statusReason: A column ID (or string accessor) is required!
