[Killed] BlockStatement
main/components/Statistics/CommonsAveragesTable.jsx:7:4
 export default function CommonsAveragesTable({
   averages,
   testIdPrefix = "CommonsAveragesTable",
-}) {
-  const columns = [
-    {
-      Header: "Dining Commons",
-      accessor: "diningCommonsCode",
-    },
-    {
-      Header: "Average Score",
-      accessor: "averageStars",
-      Cell: ({ value }) => value.toFixed(2),
-    },
-    {
-      Header: "Reviews",
-      accessor: "reviewCount",
-    },
-  ];
-
-  return <OurTable data={averages} columns={columns} testid={testIdPrefix} />;
-}
+}) {}
 
killedBy: CommonsAveragesTable tests renders all rows
statusReason: Unable to find an element by: [data-testid="CommonsAveragesTable-cell-row-0-col-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Statistics/CommonsAveragesTable.jsx:11:17
   const columns = [
     {
       Header: "Dining Commons",
-      accessor: "diningCommonsCode",
+      accessor: "",
     },
     {
killedBy: CommonsAveragesTable tests renders all rows
statusReason: Unable to find an element by: [data-testid="CommonsAveragesTable-cell-row-0-col-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
