[Killed] BlockStatement
main/components/Statistics/CommonsMealAveragesSection.jsx:5:62
 import CommonsMealAveragesTable from "main/components/Statistics/CommonsMealAveragesTable";
 import { useBackend } from "main/utils/useBackend";
 
-export default function CommonsMealAveragesSection({ code }) {
-  const { data: averages } = useBackend(
-    [`/api/statistics/commons/${code}/meals/averages`],
-    {
-      method: "GET",
-      url: `/api/statistics/commons/${code}/meals/averages`,
-    },
-    [],
-  );
-
-  if (averages && averages.length === 0) {
-    return (
-      <p data-testid="CommonsMealAveragesSection-empty">
-        No reviews available yet.
-      </p>
-    );
-  }
-
-  return (
-    <CommonsMealAveragesTable
-      averages={averages}
-      testIdPrefix="CommonsMealAveragesSection-table"
-    />
-  );
-}
+export default function CommonsMealAveragesSection({ code }) {}
 
killedBy: CommonsMealAveragesPage tests defaults to the first commons and renders its meal averages section; CommonsMealAveragesSection tests renders the table for the supplied dining commons code
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesSection-table-cell-row-0-col-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Statistics/CommonsMealAveragesSection.jsx:15:7
     [],
   );
 
-  if (averages && averages.length === 0) {
+  if (false) {
     return (
       <p data-testid="CommonsMealAveragesSection-empty">
killedBy: CommonsMealAveragesSection tests renders the empty-state message when there are no meal averages
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesSection-empty"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Statistics/CommonsMealAveragesSection.jsx:15:19
     [],
   );
 
-  if (averages && averages.length === 0) {
+  if (averages && true) {
     return (
       <p data-testid="CommonsMealAveragesSection-empty">
killedBy: CommonsMealAveragesPage tests defaults to the first commons and renders its meal averages section; CommonsMealAveragesSection tests renders the table for the supplied dining commons code
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesSection-table-cell-row-0-col-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
