[Killed] StringLiteral
main/components/Statistics/CommonsMealAveragesTable.jsx:14:15
       accessor: "mealCode",
     },
     {
-      Header: "Average Score",
+      Header: "",
       accessor: "averageStars",
       Cell: ({ value }) => value.toFixed(2),
killedBy: CommonsMealAveragesTable tests renders default headers when no testIdPrefix is provided
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Average Score
Received:
