[Killed] StringLiteral
main/components/Statistics/ItemStatisticsTable.jsx:6:18
 
 export default function ItemStatisticsTable({
   items,
-  testIdPrefix = "ItemStatisticsTable",
+  testIdPrefix = "",
 }) {
   const columns = [
killedBy: ItemStatisticsTable tests renders all columns and data
statusReason: Unable to find an element by: [data-testid="ItemStatisticsTable-cell-row-0-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Statistics/ItemStatisticsTable.jsx:9:5
   testIdPrefix = "ItemStatisticsTable",
 }) {
   const columns = [
-    {
-      Header: "Item",
-      accessor: "itemName",
-    },
+    {},
     {
       Header: "Dining Commons",
killedBy: ItemStatisticsTable tests renders all columns and data
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Statistics/ItemStatisticsTable.jsx:10:15
 }) {
   const columns = [
     {
-      Header: "Item",
+      Header: "",
       accessor: "itemName",
     },
killedBy: ItemStatisticsTable tests renders headers correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Item
Received:

[Killed] ObjectLiteral
main/components/Statistics/ItemStatisticsTable.jsx:25:5
       Header: "Station",
       accessor: "station",
     },
-    {
-      Header: "Average Score",
-      accessor: "averageStars",
-      Cell: ({ value }) => value.toFixed(2),
-    },
+    {},
     {
       Header: "Reviews",
killedBy: ItemStatisticsTable tests renders all columns and data
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Statistics/ItemStatisticsTable.jsx:32:17
     },
     {
       Header: "Reviews",
-      accessor: "reviewCount",
+      accessor: "",
     },
   ];
killedBy: ItemStatisticsTable tests renders all columns and data
statusReason: Unable to find an element by: [data-testid="ItemStatisticsTable-cell-row-0-col-reviewCount"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
