[Killed] StringLiteral
main/pages/Statistics/BestItemsPage.jsx:12:6
   const [period, setPeriod] = useState("ALL");
 
   const { data: items } = useBackend(
-    ["/api/statistics/items/best", period],
+    ["", period],
     {
       method: "GET",
killedBy: BestItemsPage tests refetches with the new period when the dropdown changes
statusReason: expected "useBackend" to be called with arguments: [ [ …(2) ], …(2) ]

Received: 

  1st useBackend call:

  [
    [

[Killed] ArrowFunction
main/pages/Statistics/BestItemsPage.jsx:39:33
             value={period}
             onChange={onChangePeriod}
           >
-            {PERIOD_OPTIONS.map((opt) => (
-              <option
-                key={opt.value}
-                value={opt.value}
-                data-testid={`BestItemsPage-period-option-${opt.value}`}
-              >
-                {opt.label}
-              </option>
-            ))}
+            {PERIOD_OPTIONS.map(() => undefined)}
           </Form.Select>
         </Form.Group>
killedBy: BestItemsPage tests renders the table when items are returned for the default ALL period
statusReason: expect(element).toHaveValue(ALL)

Expected the element to have value:
  ALL
Received:
  undefined

[Killed] ConditionalExpression
main/pages/Statistics/BestItemsPage.jsx:50:19
             ))}
           </Form.Select>
         </Form.Group>
-        {items && items.length === 0 ? (
+        {items && true ? (
           <p data-testid="BestItemsPage-empty">
             No reviews available for this period yet.
killedBy: BestItemsPage tests renders the table when items are returned for the default ALL period
statusReason: Unable to find an element by: [data-testid="BestItemsPage-table-cell-row-0-col-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Statistics/BestItemsPage.jsx:50:10
             ))}
           </Form.Select>
         </Form.Group>
-        {items && items.length === 0 ? (
+        {false ? (
           <p data-testid="BestItemsPage-empty">
             No reviews available for this period yet.
killedBy: BestItemsPage tests renders empty message when there are no items
statusReason: Unable to find an element by: [data-testid="BestItemsPage-empty"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
