[Killed] ConditionalExpression
main/pages/Statistics/CommonsAveragesOverTimePage.jsx:24:18
           Average rating per dining commons grouped by the month the meal was
           served. An averages-over-time graph is potentially coming soon.
         </p>
-        {rows && rows.length === 0 ? (
+        {rows && true ? (
           <p data-testid="CommonsAveragesOverTimePage-empty">
             No reviews available yet.
killedBy: CommonsAveragesOverTimePage tests renders the table with rows
statusReason: Unable to find an element by: [data-testid="CommonsAveragesOverTimePage-table-cell-row-0-col-period"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Statistics/CommonsAveragesOverTimePage.jsx:24:10
           Average rating per dining commons grouped by the month the meal was
           served. An averages-over-time graph is potentially coming soon.
         </p>
-        {rows && rows.length === 0 ? (
+        {true ? (
           <p data-testid="CommonsAveragesOverTimePage-empty">
             No reviews available yet.
killedBy: CommonsAveragesOverTimePage tests renders the table with rows
statusReason: Unable to find an element by: [data-testid="CommonsAveragesOverTimePage-table-cell-row-0-col-period"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
