[Killed] StringLiteral
main/pages/Statistics/CommonsAveragesPage.jsx:8:6
 
 export default function CommonsAveragesPage() {
   const { data: averages } = useBackend(
-    ["/api/statistics/commons/averages"],
+    [""],
     {
       method: "GET",
killedBy: CommonsAveragesPage tests useBackend is called with correct cache query key, axios params, and initial data
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received: 

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] ConditionalExpression
main/pages/Statistics/CommonsAveragesPage.jsx:20:22
     <BasicLayout>
       <div className="pt-2">
         <h1>Dining Commons Averages</h1>
-        {averages && averages.length === 0 ? (
+        {averages && true ? (
           <p data-testid="CommonsAveragesPage-empty">
             No reviews available yet.
killedBy: CommonsAveragesPage tests renders the table with averages
statusReason: Unable to find an element by: [data-testid="CommonsAveragesPage-table-cell-row-0-col-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
