[Killed] StringLiteral
main/pages/Statistics/CommonsMealAveragesPage.jsx:14:52
     [],
   );
 
-  const [selectedCode, setSelectedCode] = useState("");
+  const [selectedCode, setSelectedCode] = useState("Stryker was here!");
 
   const effectiveCode = selectedCode || commons[0]?.code;
killedBy: CommonsMealAveragesPage tests defaults to the first commons and renders its meal averages section
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesSection-table-cell-row-0-col-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] OptionalChaining
main/pages/Statistics/CommonsMealAveragesPage.jsx:16:41
 
   const [selectedCode, setSelectedCode] = useState("");
 
-  const effectiveCode = selectedCode || commons[0]?.code;
+  const effectiveCode = selectedCode || commons[0].code;
 
   return (
killedBy: CommonsMealAveragesPage tests renders the heading and the commons dropdown
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] EqualityOperator
main/pages/Statistics/CommonsMealAveragesPage.jsx:22:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Meal Averages by Dining Commons</h1>
-        {commons.length > 0 && (
+        {commons.length <= 0 && (
           <Form.Group className="mb-3">
             <Form.Label htmlFor="CommonsMealAveragesPage-commons-select">
killedBy: CommonsMealAveragesPage tests renders the heading and the commons dropdown
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesPage-commons-select"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Statistics/CommonsMealAveragesPage.jsx:22:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Meal Averages by Dining Commons</h1>
-        {commons.length > 0 && (
-          <Form.Group className="mb-3">
-            <Form.Label htmlFor="CommonsMealAveragesPage-commons-select">
-              Dining Commons
-            </Form.Label>
-            <Form.Select
-              id="CommonsMealAveragesPage-commons-select"
-              data-testid="CommonsMealAveragesPage-commons-select"
-              value={effectiveCode}
-              onChange={(e) => setSelectedCode(e.target.value)}
-            >
-              {commons.map((c) => (
-                <option key={c.code} value={c.code}>
-                  {c.name}
-                </option>
-              ))}
-            </Form.Select>
-          </Form.Group>
-        )}
+        {commons.length > 0 || <Form.Group className="mb-3">
+            <Form.Label htmlFor="CommonsMealAveragesPage-commons-select">
+              Dining Commons
+            </Form.Label>
+            <Form.Select id="CommonsMealAveragesPage-commons-select" data-testid="CommonsMealAveragesPage-commons-select" value={effectiveCode} onChange={e => setSelectedCode(e.target.value)}>
+              {commons.map(c => <option key={c.code} value={c.code}>
+                  {c.name}
+                </option>)}
+            </Form.Select>
+          </Form.Group>}
         {effectiveCode && <CommonsMealAveragesSection code={effectiveCode} />}
       </div>
killedBy: CommonsMealAveragesPage tests renders the heading and the commons dropdown
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesPage-commons-select"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Statistics/CommonsMealAveragesPage.jsx:41:10
             </Form.Select>
           </Form.Group>
         )}
-        {effectiveCode && <CommonsMealAveragesSection code={effectiveCode} />}
+        {true}
       </div>
     </BasicLayout>
killedBy: CommonsMealAveragesPage tests defaults to the first commons and renders its meal averages section
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesSection-table-cell-row-0-col-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Statistics/CommonsMealAveragesPage.jsx:41:10
             </Form.Select>
           </Form.Group>
         )}
-        {effectiveCode && <CommonsMealAveragesSection code={effectiveCode} />}
+        {effectiveCode || <CommonsMealAveragesSection code={effectiveCode} />}
       </div>
     </BasicLayout>
killedBy: CommonsMealAveragesPage tests defaults to the first commons and renders its meal averages section
statusReason: Unable to find an element by: [data-testid="CommonsMealAveragesSection-table-cell-row-0-col-mealCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
