[Killed] ObjectLiteral
main/pages/Statistics/statisticsConstants.js:6:3
 /** Period options accepted by the best/worst items endpoints. */
 export const PERIOD_OPTIONS = [
   { value: "ALL", label: "All time" },
-  { value: "6M", label: "Last 6 months" },
+  {},
   { value: "1M", label: "Last month" },
   { value: "1W", label: "Last week" },
killedBy: WorstItemsPage tests refetches with the new period when the dropdown changes
statusReason: expect(element).toHaveValue(6M)

Expected the element to have value:
  6M
Received:

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:7:25
 export const PERIOD_OPTIONS = [
   { value: "ALL", label: "All time" },
   { value: "6M", label: "Last 6 months" },
-  { value: "1M", label: "Last month" },
+  { value: "1M", label: "" },
   { value: "1W", label: "Last week" },
 ];
killedBy: BestItemsPage tests exposes the expected literal period options
statusReason: expected [ { value: 'ALL', …(1) }, …(3) ] to deeply equal [ { value: 'ALL', …(1) }, …(3) ]

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:7:12
 export const PERIOD_OPTIONS = [
   { value: "ALL", label: "All time" },
   { value: "6M", label: "Last 6 months" },
-  { value: "1M", label: "Last month" },
+  { value: "", label: "Last month" },
   { value: "1W", label: "Last week" },
 ];
killedBy: BestItemsPage tests exposes the expected literal period options
statusReason: expected [ { value: 'ALL', …(1) }, …(3) ] to deeply equal [ { value: 'ALL', …(1) }, …(3) ]

[Killed] ObjectLiteral
main/pages/Statistics/statisticsConstants.js:13:3
 
 /** Cards displayed on the statistics overview page. */
 export const STATISTICS_PAGES = [
-  {
-    title: "Best Rated Items",
-    description:
-      "See the highest rated menu items overall and in recent time windows.",
-    to: "/statistics/items/best",
-    testid: "StatisticsIndexPage-best-items",
-    comingSoon: false,
-  },
+  {},
   {
     title: "Worst Rated Items",
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: It looks like undefined was passed instead of a matcher. Did you do something like getByText(undefined)?

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:19:17
       "See the highest rated menu items overall and in recent time windows.",
     to: "/statistics/items/best",
     testid: "StatisticsIndexPage-best-items",
-    comingSoon: false,
+    comingSoon: true,
   },
   {
killedBy: StatisticsIndexPage tests exposes the expected comingSoon flags
statusReason: expected [ true, false, false, false, false ] to deeply equal [ false, false, false, false, false ]

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:24:7
   {
     title: "Worst Rated Items",
     description:
-      "See the lowest rated menu items overall and in recent time windows.",
+      "",
     to: "/statistics/items/worst",
     testid: "StatisticsIndexPage-worst-items",
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: Found multiple elements with the text: 

Here are the matching elements:

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:26:13
     description:
       "See the lowest rated menu items overall and in recent time windows.",
     to: "/statistics/items/worst",
-    testid: "StatisticsIndexPage-worst-items",
+    testid: "",
     comingSoon: false,
   },
killedBy: StatisticsIndexPage tests exposes the expected list of test ids
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] BooleanLiteral
main/pages/Statistics/statisticsConstants.js:27:17
       "See the lowest rated menu items overall and in recent time windows.",
     to: "/statistics/items/worst",
     testid: "StatisticsIndexPage-worst-items",
-    comingSoon: false,
+    comingSoon: true,
   },
   {
killedBy: StatisticsIndexPage tests exposes the expected comingSoon flags
statusReason: expected [ false, true, false, false, false ] to deeply equal [ false, false, false, false, false ]

[Killed] ObjectLiteral
main/pages/Statistics/statisticsConstants.js:29:3
     testid: "StatisticsIndexPage-worst-items",
     comingSoon: false,
   },
-  {
-    title: "Dining Commons Averages",
-    description: "Average review score for each dining commons.",
-    to: "/statistics/commons/averages",
-    testid: "StatisticsIndexPage-commons-averages",
-    comingSoon: false,
-  },
+  {},
   {
     title: "Dining Commons Averages Over Time",
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: It looks like undefined was passed instead of a matcher. Did you do something like getByText(undefined)?

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:37:12
     comingSoon: false,
   },
   {
-    title: "Dining Commons Averages Over Time",
+    title: "",
     description: "Average review score for each dining commons by month.",
     to: "/statistics/commons/overtime",
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: Found multiple elements with the text: 

Here are the matching elements:

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:40:13
     title: "Dining Commons Averages Over Time",
     description: "Average review score for each dining commons by month.",
     to: "/statistics/commons/overtime",
-    testid: "StatisticsIndexPage-commons-overtime",
+    testid: "",
     comingSoon: false,
   },
killedBy: StatisticsIndexPage tests exposes the expected list of test ids
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] ObjectLiteral
main/pages/Statistics/statisticsConstants.js:43:3
     testid: "StatisticsIndexPage-commons-overtime",
     comingSoon: false,
   },
-  {
-    title: "Meal Averages by Dining Commons",
-    description: "Average review score for each meal at a dining commons.",
-    to: "/statistics/commons/meals",
-    testid: "StatisticsIndexPage-commons-meals",
-    comingSoon: false,
-  },
+  {},
 ];
 
killedBy: StatisticsIndexPage tests renders enabled View links and disabled Coming Soon buttons
statusReason: It looks like undefined was passed instead of a matcher. Did you do something like getByText(undefined)?

[Killed] StringLiteral
main/pages/Statistics/statisticsConstants.js:47:13
     title: "Meal Averages by Dining Commons",
     description: "Average review score for each meal at a dining commons.",
     to: "/statistics/commons/meals",
-    testid: "StatisticsIndexPage-commons-meals",
+    testid: "",
     comingSoon: false,
   },
killedBy: StatisticsIndexPage tests exposes the expected list of test ids
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]
