[Killed] ConditionalExpression
main/components/Moderation/ModerationModal.jsx:35:10
             data-testid="moderation-modal-comments"
           />
         </Form.Group>
-        {review && (
-          <div className="mt-3">
-            <strong>Review ID:</strong> {review.id}
-            <br />
-            <strong>Item:</strong> {review.item?.name ?? "Unknown"}
-          </div>
-        )}
+        {false}
       </Modal.Body>
       <Modal.Footer>
killedBy: ModerationModal tests renders approve modal with review details and disabled submit when comments are empty
statusReason: Unable to find an element with the text: /Review ID:/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
